<template>
  <div class="home">
    <h1>Homepage</h1>
    <p>根据地理学家，地质学见以及其他科学家的研究，澄蓝星球原本没有陆地，只有茫茫无边的海洋。在星落元年有一颗源于外星系的陨星飞向澄蓝，碎片主体碰撞后产生了星落大陆，而其他碎片落在大陆附近，分别形成了其它文明土壤。</p>
    <p>
    艾尔斯图和洛擎 Alston & Luoqing: (艾尔斯图有许多朝代更替，但在星落1230年仍为帝国；洛擎在星落933年建立王国)
    最开始艾尔斯图和洛擎是一片大陆，从古代到现代的君主制。在星落578年左右大批莹栩人通过????海峡进入艾尔斯图帝国经商和居住。经过三百余年的交通，莹栩人在艾尔斯图已经有立足之地，迫切向往能有更多权利。君主的两子因对莹栩人态度不同从而执兵相战，长子被击败，次子准许莹栩人在东南部的土地建立自己的洛擎王国以换取艾尔斯图的和平以及保留种族纯洁性。莹栩人在东南部建立的洛擎王国模仿艾尔斯图采取君主制。
    </p>

    <p>
    斯坦林德 Stanleind: (斯坦林德在星落612年成立共和国)
    斯坦林德是位于艾尔斯图和莹栩之间横向延伸的一个国家。自古以来莹栩到艾尔斯图的通商在北部通常经由斯坦林德，便有商队在此范围修顿，逐渐有了小范围的商业城镇。星落612年几座商会坐拥的城镇签订协议，形成斯坦林德共和国。后在星落926年太子落日战役（上文提及）中借机占领艾尔斯图帝国小片东北部版图。
    </p>
  </div>
</template>

<script>

export default {
  name: 'HomeView',
  components: {
    
  }
}
</script>
